README.org
#+title: Genómica de la biodiversidad
#+description: Genómica de la biodiversidad
#+language: es
#+options: h:3 num:t||nil toc:t author:nil date:nil *:t


#+options: ^:t f:t

* Estructura del curso
** TODO Dia 1
*** TODO Introduccion a unix
*** TODO Introduccion al cluster de computo
** TODO Dia 2
** TODO Dia 3
** TODO Dia 4
** TODO Dia 5
   
* Programas y herramientas requeridos

** Usuarios de Windows
  
*** Emuladores de UNIX
    - [ ] [[https://mobaxterm.mobatek.net/][MobaXterm]]
    - [ ] Es posible [[https://discourse.ubuntu.com/t/instalacion-de-ubuntu-en-windows-10/14949][instalar la terminal de Ubuntu en Windows 10]]

*** Editores de texto
    - [ ] [[https://notepad-plus-plus.org/][Notepad++]]
    - [ ] [[https://atom.io/][Atom]]
    - [ ] [[https://code.visualstudio.com/Download][Visual studio code]]
    - [ ] [[https://gedit.en.softonic.com/][gEdit]]
    
** Usuarios de Mac (OSX)
  
*** Emuladores de terminal
    - [ ] Terminal: Emulador nativo
    - [ ] [[https://iterm2.com/][iTerm2]]

*** Editores de texto
    - [ ] [[https://www.barebones.com/products/bbedit/index.html][Bbedit]]
    - [ ] [[https://atom.io/][Atom]]
    - [ ] [[https://code.visualstudio.com/Download][Visual studio code]]
    - [ ] [[https://macromates.com/download][Textmate]]
    - [ ] [[https://www.nano-editor.org/][Nano]] [fn:1]
    - [ ] [[https://neovim.io/][Vim / NeoVim]] [fn:2]
    - [ ] [[https://www.gnu.org/software/emacs/][Emacs]] [fn:2]

** Usuarios de Linux
  
*** Emuladores de terminal
    - [ ] Terminal: Emulador nativo
    - [ ] [[https://gnome-terminator.org/][Terminator]]
    - [ ] [[https://gnunn1.github.io/tilix-web/][Tilix]]
   
*** Editores de texto
    - [ ] Mousepad (Xfce)
    - [ ] [[https://code.visualstudio.com/Download][Visual studio code / Code - OSS]]
    - [ ] gEdit (Ubuntu)
    - [ ] [[https://atom.io/][Atom]] 
    - [ ] [[https://www.nano-editor.org/][Nano]] [fn:1]
    - [ ] [[https://neovim.io/][Vim / NeoVim]] [fn:2]
    - [ ] [[https://www.gnu.org/software/emacs/][Emacs]] [fn:2]
    
** Análisis estadístico
   Usaremos el paquete estadístico R para hacer algunos análisis/gráficos.
   Recomendamos el uso de RStudio, que es un ambiente de desarollo que
   complementa a R. RStudio está disponible para descarga [[https://www.rstudio.com/products/rstudio/download/#download][aquí.]]
    
* Lecturas recomendadas
  
** TODO 
   
[fn:1] Este es el editor que usaremos en el cluster de cómputo.

[fn:2] Estos editores no son `beginner-friendly'. Es necesario aprender muchas
  funciones y atajos antes de poder usarlos fluídamente. Están disponibles
  también en el cluster de cómputo.

