README.md

# &Iacute;ndice

1.  [Estructura del curso](#org4cb3f36)
    1.  [Dia 1](#org44af1a2)
        1.  [Introduccion a unix](#org4a2728a)
        2.  [Introduccion al cluster de computo](#orga9304e6)
    2.  [Dia 2](#org4d8db05)
    3.  [Dia 3](#orgf29ee58)
    4.  [Dia 4](#org4fa2736)
    5.  [Dia 5](#org9cca4ca)
2.  [Programas y herramientas requeridos](#orga173e58)
    1.  [Usuarios de Windows](#org2fa0694)
        1.  [Emuladores de UNIX](#orgd895a32)
        2.  [Editores de texto](#org5239d5c)
    2.  [Usuarios de Mac (OSX)](#orgd379fd2)
        1.  [Emuladores de terminal](#orgaff2b80)
        2.  [Editores de texto](#org4656b9f)
    3.  [Usuarios de Linux](#org9a144e0)
        1.  [Emuladores de terminal](#orgfd1c4bf)
        2.  [Editores de texto](#org78ebab2)
    4.  [Análisis estadístico](#org56ccb01)
3.  [Lecturas recomendadas](#org32ae1b0)
    1.  [](#orgdb81949)



<a id="org4cb3f36"></a>

# Estructura del curso


<a id="org44af1a2"></a>

## TODO Dia 1


<a id="org4a2728a"></a>

### TODO Introduccion a unix


<a id="orga9304e6"></a>

### TODO Introduccion al cluster de computo


<a id="org4d8db05"></a>

## TODO Dia 2


<a id="orgf29ee58"></a>

## TODO Dia 3


<a id="org4fa2736"></a>

## TODO Dia 4


<a id="org9cca4ca"></a>

## TODO Dia 5


<a id="orga173e58"></a>

# Programas y herramientas requeridos


<a id="org2fa0694"></a>

## Usuarios de Windows


<a id="orgd895a32"></a>

### Emuladores de UNIX

-   [ ] [MobaXterm](https://mobaxterm.mobatek.net/)
-   [ ] Es posible [instalar la terminal de Ubuntu en Windows 10](https://discourse.ubuntu.com/t/instalacion-de-ubuntu-en-windows-10/14949)


<a id="org5239d5c"></a>

### Editores de texto

-   [ ] [Notepad++](https://notepad-plus-plus.org/)
-   [ ] [Atom](https://atom.io/)
-   [ ] [Visual studio code](https://code.visualstudio.com/Download)
-   [ ] [gEdit](https://gedit.en.softonic.com/)


<a id="orgd379fd2"></a>

## Usuarios de Mac (OSX)


<a id="orgaff2b80"></a>

### Emuladores de terminal

-   [ ] Terminal: Emulador nativo
-   [ ] [iTerm2](https://iterm2.com/)


<a id="org4656b9f"></a>

### Editores de texto

-   [ ] [Bbedit](https://www.barebones.com/products/bbedit/index.html)
-   [ ] [Atom](https://atom.io/)
-   [ ] [Visual studio code](https://code.visualstudio.com/Download)
-   [ ] [Textmate](https://macromates.com/download)
-   [ ] [Nano](https://www.nano-editor.org/) <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
-   [ ] [Vim / NeoVim](https://neovim.io/) <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
-   [ ] [Emacs](https://www.gnu.org/software/emacs/) <sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>


<a id="org9a144e0"></a>

## Usuarios de Linux


<a id="orgfd1c4bf"></a>

### Emuladores de terminal

-   [ ] Terminal: Emulador nativo
-   [ ] [Terminator](https://gnome-terminator.org/)
-   [ ] [Tilix](https://gnunn1.github.io/tilix-web/)


<a id="org78ebab2"></a>

### Editores de texto

-   [ ] Mousepad (Xfce)
-   [ ] [Visual studio code / Code - OSS](https://code.visualstudio.com/Download)
-   [ ] gEdit (Ubuntu)
-   [ ] [Atom](https://atom.io/)
-   [ ] [Nano](https://www.nano-editor.org/) <sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>
-   [ ] [Vim / NeoVim](https://neovim.io/) <sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>
-   [ ] [Emacs](https://www.gnu.org/software/emacs/) <sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>


<a id="org56ccb01"></a>

## Análisis estadístico

Usaremos el paquete estadístico R para hacer algunos análisis/gráficos.
Recomendamos el uso de RStudio, que es un ambiente de desarollo que
complementa a R. RStudio está disponible para descarga [aquí.](https://www.rstudio.com/products/rstudio/download/)


<a id="org32ae1b0"></a>

# Lecturas recomendadas


<a id="orgdb81949"></a>

## TODO 


# Nota al pie de p&aacute;gina

<sup><a id="fn.1" href="#fnr.1">1</a></sup> Este es el editor que usaremos en el cluster de cómputo.

<sup><a id="fn.2" href="#fnr.2">2</a></sup> Estos editores no son \`beginner-friendly'. Es necesario aprender muchas
funciones y atajos antes de poder usarlos fluídamente. Están disponibles
también en el cluster de cómputo.
